# Split dataframe by school code and get mean,min and max value of age for each school

In [1]:
import pandas as pd

In [7]:
dataF = pd.DataFrame({"school_code":['s001','s002','s003','s001','s002','s004'],
                      "class":['V','V','VI','VI','V','VI'],
                      "name":['Albero Franco','Gino Mcneill','Ryan Parkes','Easha Hinton','Gino Mcneill','David parkes'],
                      "dob":['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
                      "age":[12,12,13,13,14,12],
                      "height":[173,192,186,167,151,159],
                      "weight":[35,32,33,30,31,32],
                      "address":['street1','street2','street3','street1','street2','street4']
                      
                     })

In [8]:
dataF

  school_code class           name         dob  age  height  weight  address
0        s001     V  Albero Franco  15/05/2002   12     173      35  street1
1        s002     V   Gino Mcneill  17/05/2002   12     192      32  street2
2        s003    VI    Ryan Parkes  16/02/1999   13     186      33  street3
3        s001    VI   Easha Hinton  25/09/1998   13     167      30  street1
4        s002     V   Gino Mcneill  11/05/2002   14     151      31  street2
5        s004    VI   David parkes  15/09/1997   12     159      31  street4